{
    "finance": [
      "What is the time value of money?",
      "How do you assess the financial health of a company?",
      "What are the different types of financial statements?",
      "Explain the difference between profit and cash flow.",
      "What is EBITDA?",
      "How do you perform a financial analysis?",
      "What is a balance sheet?",
      "Explain the concept of working capital.",
      "What is the role of a financial analyst?",
      "How do you evaluate investment opportunities?",
      "What is a financial model?",
      "Explain the difference between debt and equity.",
      "What is the purpose of a cash flow statement?",
      "How do you calculate return on investment (ROI)?",
      "What is a capital expenditure?",
      "What are the main components of a financial plan?",
      "How do you manage financial risk?",
      "What is the difference between gross and net income?",
      "Explain the concept of cost of capital.",
      "What is financial forecasting?"
    ],
    "marketing": [
      "What is the role of marketing in a business?",
      "How do you conduct market research?",
      "What is a SWOT analysis?",
      "Explain the 4 Ps of marketing.",
      "What is the difference between B2B and B2C marketing?",
      "How do you measure marketing effectiveness?",
      "What is a marketing mix?",
      "Explain the concept of brand positioning.",
      "What is the role of social media in marketing?",
      "How do you develop a marketing strategy?",
      "What is content marketing?",
      "Explain the concept of customer segmentation.",
      "What is a marketing campaign?",
      "How do you create a customer persona?",
      "What is the importance of SEO in digital marketing?",
      "Explain the concept of inbound marketing.",
      "What is the role of analytics in marketing?",
      "How do you manage a marketing budget?",
      "What is the difference between traditional and digital marketing?",
      "Explain the concept of customer lifetime value."
    ],
    "software": [
      "What is object-oriented programming?",
      "Explain the concept of a database.",
      "What is a software development lifecycle (SDLC)?",
      "How do you manage version control in software development?",
      "What is the importance of testing in software development?",
      "Explain the concept of agile methodology.",
      "What is a design pattern?",
      "How do you handle errors in software applications?",
      "What is the role of a software architect?",
      "Explain the concept of continuous integration.",
      "What is a RESTful API?",
      "How do you optimize the performance of a software application?",
      "What is the difference between frontend and backend development?",
      "Explain the concept of cloud computing.",
      "What is the role of a DevOps engineer?",
      "How do you ensure the security of a software application?",
      "What is the importance of code reviews?",
      "Explain the concept of microservices.",
      "What is the difference between synchronous and asynchronous programming?",
      "How do you manage dependencies in a software project?"
    ],
    "design": [
      "What is the role of a UX designer?",
      "How do you conduct user research?",
      "Explain the concept of wireframing.",
      "What is the importance of prototyping in design?",
      "How do you create a user journey map?",
      "What is the difference between UX and UI design?",
      "Explain the concept of design thinking.",
      "What is the role of a graphic designer?",
      "How do you ensure accessibility in design?",
      "What is the importance of typography in design?",
      "Explain the concept of responsive design.",
      "What is a design system?",
      "How do you conduct a design critique?",
      "What is the role of a product designer?",
      "How do you create a design brief?",
      "What is the importance of user testing in design?",
      "Explain the concept of visual hierarchy.",
      "What is the role of color theory in design?",
      "How do you create a style guide?",
      "What is the importance of consistency in design?"
    ],
    "sales": [
      "What is the role of a sales manager?",
      "How do you develop a sales strategy?",
      "Explain the concept of sales forecasting.",
      "What is the importance of customer relationship management (CRM)?",
      "How do you conduct a sales pitch?",
      "What is the role of a sales representative?",
      "How do you manage a sales team?",
      "Explain the concept of lead generation.",
      "What is the importance of networking in sales?",
      "How do you handle sales objections?",
      "What is the role of a sales funnel?",
      "How do you close a sale?",
      "What is the importance of follow-up in sales?",
      "Explain the concept of upselling.",
      "How do you develop a sales pipeline?",
      "What is the role of market research in sales?",
      "How do you measure sales performance?",
      "What is the importance of customer feedback in sales?",
      "Explain the concept of cross-selling.",
      "How do you create a sales plan?"
    ]
  }
  